#### 들어가기 전
***
# Python Interface for Oracle Database

## 오라클 서버에 접속하여 HR계정 사용

In [2]:
import cx_Oracle
xedb = cx_Oracle.connect('hr/hr@localhost/xe')
cur = xedb.cursor()

In [9]:
# 1. 한 행씩 출력하기
cur.execute('select * from departments order by department_id')
for result in cur:
    print(result)

(10, 'Administration', 200, 1700)
(20, 'Marketing', 201, 1800)
(30, 'Purchasing', 114, 1700)
(40, 'Human Resources', 203, 2400)
(50, 'Shipping', 121, 1500)
(60, 'IT', 103, 1400)
(70, 'Public Relations', 204, 2700)
(80, 'Sales', 145, 2500)
(90, 'Executive', 100, 1700)
(100, 'Finance', 108, 1700)
(110, 'Accounting', 205, 1700)
(120, 'Treasury', None, 1700)
(130, 'Corporate Tax', None, 1700)
(140, 'Control And Credit', None, 1700)
(150, 'Shareholder Services', None, 1700)
(160, 'Benefits', None, 1700)
(170, 'Manufacturing', None, 1700)
(180, 'Construction', None, 1700)
(190, 'Contracting', None, 1700)
(200, 'Operations', None, 1700)
(210, 'IT Support', None, 1700)
(220, 'NOC', None, 1700)
(230, 'IT Helpdesk', None, 1700)
(240, 'Government Sales', None, 1700)
(250, 'Retail Sales', None, 1700)
(260, 'Recruiting', None, 1700)
(270, 'Payroll', None, 1700)

In [10]:
# 2
cur.execute('select * from departments order by department_id')
print(cur.fetchall())

[(10, 'Administration', 200, 1700), (20, 'Marketing', 201, 1800), (30, 'Purchasing', 114, 1700), (40, 'Human Resources', 203, 2400), (50, 'Shipping', 121, 1500), (60, 'IT', 103, 1400), (70, 'Public Relations', 204, 2700), (80, 'Sales', 145, 2500), (90, 'Executive', 100, 1700), (100, 'Finance', 108, 1700), (110, 'Accounting', 205, 1700), (120, 'Treasury', None, 1700), (130, 'Corporate Tax', None, 1700), (140, 'Control And Credit', None, 1700), (150, 'Shareholder Services', None, 1700), (160, 'Benefits', None, 1700), (170, 'Manufacturing', None, 1700), (180, 'Construction', None, 1700), (190, 'Contracting', None, 1700), (200, 'Operations', None, 1700), (210, 'IT Support', None, 1700), (220, 'NOC', None, 1700), (230, 'IT Helpdesk', None, 1700), (240, 'Government Sales', None, 1700), (250, 'Retail Sales', None, 1700), (260, 'Recruiting', None, 1700), (270, 'Payroll', None, 1700)]

In [11]:
# 3 DataFrame형식으로 출력

import pandas as pd
df = pd.read_sql_query('select * from departments order by department_id', xedb)
print(df)

    DEPARTMENT_ID       DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
0              10        Administration       200.0         1700
1              20             Marketing       201.0         1800
2              30            Purchasing       114.0         1700
3              40       Human Resources       203.0         2400
4              50              Shipping       121.0         1500
5              60                    IT       103.0         1400
6              70      Public Relations       204.0         2700
7              80                 Sales       145.0         2500
8              90             Executive       100.0         1700
9             100               Finance       108.0         1700
10            110            Accounting       205.0         1700
11            120              Treasury         NaN         1700
12            130         Corporate Tax         NaN         1700
13            140    Control And Credit         NaN         1700
14            150  Shareholder Services         NaN         1700
15            160              Benefits         NaN         1700
16            170         Manufacturing         NaN         1700
17            180          Construction         NaN         1700
18            190           Contracting         NaN         1700
19            200            Operations         NaN         1700
20            210            IT Support         NaN         1700
21            220                   NOC         NaN         1700
22            230           IT Helpdesk         NaN         1700
23            240      Government Sales         NaN         1700
24            250          Retail Sales         NaN         1700
25            260            Recruiting         NaN         1700
26            270               Payroll         NaN         1700

In [12]:
# 커서 종료하기
cur.close()
xedb.close()

*******

# SQL 문
* DQL(Data Query Language)   : select
* DML(Data Manipulation Language)  :  insert, update, delete, merge
* TCL(Transaction Control Language) : commit, rollback, savepoint
* DDL(Data Definition Language)  : create, alter, drop, rename, truncate, comment
* DCL(Data Control Language) : grant, revoke
****
## CHAPTER 1 _기본 연습문제

In [2]:
import cx_Oracle
xedb = cx_Oracle.connect('hr/hr@localhost/xe')
cur = xedb.cursor()

import pandas as pd

###  < 컬럼의 별칭 >
#### (1) employees테이블에서 employee_id, last_name, first_name을 조회하고, 이름과 성을 연결하세요. 그리고 열별칭은 각각 'EMP', 'NAME'으로 나타내세요.

In [4]:
df = pd.read_sql("""
                 SELECT employee_id AS EMP, last_name||' '|| first_name AS NAME
                 FROM employees
                 """,xedb)
print(df)

     EMP               NAME
0    100        King Steven
1    101      Kochhar Neena
2    102        De Haan Lex
3    103   Hunold Alexander
4    104        Ernst Bruce
5    105       Austin David
6    106    Pataballa Valli
7    107      Lorentz Diana
8    108    Greenberg Nancy
9    109      Faviet Daniel
10   110          Chen John
11   111     Sciarra Ismael
12   112  Urman Jose Manuel
13   113          Popp Luis
14   114       Raphaely Den
15   115     Khoo Alexander
16   116       Baida Shelli
17   117       Tobias Sigal
18   118         Himuro Guy
19   119   Colmenares Karen
20   120      Weiss Matthew
21   121         Fripp Adam
22   122     Kaufling Payam
23   123     Vollman Shanta
24   124      Mourgos Kevin
25   125        Nayer Julia
26   126  Mikkilineni Irene
27   127       Landry James
28   128      Markle Steven
29   129       Bissot Laura
..   ...                ...
77   177    Livingston Jack
78   178    Grant Kimberely
79   179    Johnson Charles
80   180     Taylor Winston
81   181        Fleaur Jean
82   182    Sullivan Martha
83   183       Geoni Girard
84   184   Sarchand Nandita
85   185        Bull Alexis
86   186    Dellinger Julia
87   187     Cabrio Anthony
88   188        Chung Kelly
89   189     Dilly Jennifer
90   190      Gates Timothy
91   191    Perkins Randall
92   192         Bell Sarah
93   193    Everett Britney
94   194      McCain Samuel
95   195        Jones Vance
96   196        Walsh Alana
97   197       Feeney Kevin
98   198    OConnell Donald
99   199      Grant Douglas
100  200    Whalen Jennifer
101  201  Hartstein Michael
102  202            Fay Pat
103  203       Mavris Susan
104  204       Baer Hermann
105  205    Higgins Shelley
106  206      Gietz William

[107 rows x 2 columns]

###  < WHERE절을 이용한 행제한 / 비교연산자, 논리연산자 >
#### (2) 급여가 5000~12000 범위에 속하지 않은 모든 사원의 last_name과 salary를 조회하세요

In [5]:
df = pd.read_sql("""
                 SELECT last_name, salary
                 FROM employees
                 WHERE salary < 5000
                 OR salary > 12000
                 """,xedb)
print(df)

      LAST_NAME   SALARY
0          King  24000.0
1       Kochhar  17000.0
2       De Haan  17000.0
3        Austin   4800.0
4     Pataballa   4800.0
5       Lorentz   4200.0
6     Greenberg  12008.0
7          Khoo   3100.0
8         Baida   2900.0
9        Tobias   2800.0
10       Himuro   2600.0
11   Colmenares   2500.0
12        Nayer   3200.0
13  Mikkilineni   2700.0
14       Landry   2400.0
15       Markle   2200.0
16       Bissot   3300.0
17     Atkinson   2800.0
18       Marlow   2500.0
19        Olson   2100.0
20       Mallin   3300.0
21       Rogers   2900.0
22          Gee   2400.0
23   Philtanker   2200.0
24       Ladwig   3600.0
25       Stiles   3200.0
26          Seo   2700.0
27        Patel   2500.0
28         Rajs   3500.0
29       Davies   3100.0
30        Matos   2600.0
31       Vargas   2500.0
32      Russell  14000.0
33     Partners  13500.0
34       Taylor   3200.0
35       Fleaur   3100.0
36     Sullivan   2500.0
37        Geoni   2800.0
38     Sarchand   4200.0
39         Bull   4100.0
40    Dellinger   3400.0
41       Cabrio   3000.0
42        Chung   3800.0
43        Dilly   3600.0
44        Gates   2900.0
45      Perkins   2500.0
46         Bell   4000.0
47      Everett   3900.0
48       McCain   3200.0
49        Jones   2800.0
50        Walsh   3100.0
51       Feeney   3000.0
52     OConnell   2600.0
53        Grant   2600.0
54       Whalen   4400.0
55    Hartstein  13000.0
56      Higgins  12008.0

#### (3) 2006년도 입사한 사원의 employee_id, last_name, hire_date를 검색하세요.

In [6]:
df = pd.read_sql("""
                 SELECT employee_id, last_name, hire_date
                 FROM employees 
                 WHERE hire_date BETWEEN to_date('20060101000000','YYYYMMDDHH24MISS') 
                 AND to_date('20061231235959', 'YYYYMMDDHH24MISS')
                 """,xedb)
print(df)

    EMPLOYEE_ID    LAST_NAME  HIRE_DATE
0           103       Hunold 2006-01-03
1           106    Pataballa 2006-02-05
2           112        Urman 2006-03-07
3           118       Himuro 2006-11-15
4           126  Mikkilineni 2006-09-28
5           134       Rogers 2006-08-26
6           139          Seo 2006-02-12
7           140        Patel 2006-04-06
8           143        Matos 2006-03-15
9           144       Vargas 2006-07-09
10          153        Olsen 2006-03-30
11          154    Cambrault 2006-12-09
12          161       Sewall 2006-11-03
13          169        Bloom 2006-03-23
14          170          Fox 2006-01-24
15          176       Taylor 2006-03-24
16          177   Livingston 2006-04-23
17          180       Taylor 2006-01-24
18          181       Fleaur 2006-02-23
19          186    Dellinger 2006-06-24
20          190        Gates 2006-07-11
21          194       McCain 2006-07-01
22          196        Walsh 2006-04-24
23          197       Feeney 2006-05-23

#### (4) job_id가 'st_clerk'이고, 2005년에 입사한 사원들의 정보를 조회하세요.

In [7]:
df = pd.read_sql("""
                 SELECT employee_id, last_name, salary, hire_date
                 FROM employees
                 WHERE job_id='ST_CLERK' 
                 AND hire_date>=to_date('2005-01-01', 'yyyy-mm-dd')
                 AND hire_date<to_date('2006-01-01','yyyy-mm-dd')
                 """,xedb)
print(df)

   EMPLOYEE_ID LAST_NAME  SALARY  HIRE_DATE
0          125     Nayer  3200.0 2005-07-16
1          129    Bissot  3300.0 2005-08-20
2          130  Atkinson  2800.0 2005-10-30
3          131    Marlow  2500.0 2005-02-16
4          138    Stiles  3200.0 2005-10-26
5          142    Davies  3100.0 2005-01-29

### < IN, NOT IN >
#### (5) Matos 및 Taylor라는 last_name을 가진 사원의 last_name, job_id, hire_date를 표시하는 보고서를 작성합니다.(hire_date를 기준으로 오름차순으로 출력)

In [8]:
df = pd.read_sql("""
                 SELECT last_name, job_id, hire_date
                 FROM employees
                 WHERE last_name IN ('Matos','Taylor')
                 ORDER BY hire_date
                 """,xedb)
print(df)

  LAST_NAME    JOB_ID  HIRE_DATE
0    Taylor  SH_CLERK 2006-01-24
1     Matos  ST_CLERK 2006-03-15
2    Taylor    SA_REP 2006-03-24

#### (6) job_id가 IT_PROG, ST_CLERK 또는 SA_REP가 아닌 모든 사원의 last_name, job_id를 검색하세요.

In [9]:
df = pd.read_sql("""
                 SELECT last_name, job_id
                 FROM employees
                 WHERE job_id NOT IN('IT_PROG', 'ST_CLERK', 'SA_REP')
                 """,xedb)
print(df)

     LAST_NAME      JOB_ID
0         Baer      PR_REP
1        Baida    PU_CLERK
2         Bell    SH_CLERK
3         Bull    SH_CLERK
4       Cabrio    SH_CLERK
5    Cambrault      SA_MAN
6         Chen  FI_ACCOUNT
7        Chung    SH_CLERK
8   Colmenares    PU_CLERK
9      De Haan       AD_VP
10   Dellinger    SH_CLERK
11       Dilly    SH_CLERK
12   Errazuriz      SA_MAN
13     Everett    SH_CLERK
14      Faviet  FI_ACCOUNT
15         Fay      MK_REP
16      Feeney    SH_CLERK
17      Fleaur    SH_CLERK
18       Fripp      ST_MAN
19       Gates    SH_CLERK
20       Geoni    SH_CLERK
21       Gietz  AC_ACCOUNT
22       Grant    SH_CLERK
23   Greenberg      FI_MGR
24   Hartstein      MK_MAN
25     Higgins      AC_MGR
26      Himuro    PU_CLERK
27       Jones    SH_CLERK
28    Kaufling      ST_MAN
29        Khoo    PU_CLERK
30        King     AD_PRES
31     Kochhar       AD_VP
32      Mavris      HR_REP
33      McCain    SH_CLERK
34     Mourgos      ST_MAN
35    OConnell    SH_CLERK
36    Partners      SA_MAN
37     Perkins    SH_CLERK
38        Popp  FI_ACCOUNT
39    Raphaely      PU_MAN
40     Russell      SA_MAN
41    Sarchand    SH_CLERK
42     Sciarra  FI_ACCOUNT
43    Sullivan    SH_CLERK
44      Taylor    SH_CLERK
45      Tobias    PU_CLERK
46       Urman  FI_ACCOUNT
47     Vollman      ST_MAN
48       Walsh    SH_CLERK
49       Weiss      ST_MAN
50      Whalen     AD_ASST
51     Zlotkey      SA_MAN

### < NULL, NOT NULL  >
#### (7) 관리자가 없는 모든 사원의 last_name과 관리자(manager_id)를 검색하세요.

In [10]:
df = pd.read_sql("""
                 SELECT last_name, manager_id
                 FROM employees
                 WHERE manager_id IS NULL
                 """,xedb)
print(df)

  LAST_NAME MANAGER_ID
0      King       None

### < order by를 이용한 정렬 >
#### (8) commission_pct이 null 아닌 모든 사원의 last_name, salary, commission_pct를 표시하는 보고서를 작성합니다. salary 및 commission_pct의 데이터를 내림차순으로 정렬하세요.

In [11]:
df = pd.read_sql("""
                 SELECT last_name, salary, commission_pct
                 FROM employees
                 WHERE commission_pct IS NOT NULL
                 ORDER BY salary DESC, commission_pct DESC
                 """,xedb)
print(df)

     LAST_NAME   SALARY  COMMISSION_PCT
0      Russell  14000.0            0.40
1     Partners  13500.0            0.30
2    Errazuriz  12000.0            0.30
3         Ozer  11500.0            0.25
4    Cambrault  11000.0            0.30
5         Abel  11000.0            0.30
6      Vishney  10500.0            0.25
7      Zlotkey  10500.0            0.20
8         King  10000.0            0.35
9       Tucker  10000.0            0.30
10       Bloom  10000.0            0.20
11         Fox   9600.0            0.20
12       Sully   9500.0            0.35
13   Bernstein   9500.0            0.25
14      Greene   9500.0            0.15
15      McEwen   9000.0            0.35
16        Hall   9000.0            0.25
17      Hutton   8800.0            0.25
18      Taylor   8600.0            0.20
19  Livingston   8400.0            0.20
20       Smith   8000.0            0.30
21       Olsen   8000.0            0.20
22       Doran   7500.0            0.30
23   Cambrault   7500.0            0.20
24       Smith   7400.0            0.15
25       Bates   7300.0            0.15
26     Marvins   7200.0            0.10
27      Sewall   7000.0            0.25
28     Tuvault   7000.0            0.15
29       Grant   7000.0            0.15
30         Lee   6800.0            0.10
31        Ande   6400.0            0.10
32       Banda   6200.0            0.10
33     Johnson   6200.0            0.10
34       Kumar   6100.0            0.10

### < 문자열 검색_LIKE >
#### (9) last_name의 세번째 문자가 'a' 또는 'e'가 포함된 모든 사원의 last_name을 출력하세요.

In [12]:
df = pd.read_sql("""
                 SELECT DISTINCT last_name
                 FROM employees
                 WHERE last_name LIKE '__a%'
                 OR last_name LIKE '__e%'
                 """,xedb)
print(df)

    LAST_NAME
0        Abel
1        Baer
2        Chen
3     Everett
4      Feeney
5      Fleaur
6         Gee
7       Gietz
8       Grant
9   Greenberg
10     Greene
11        Lee
12       Ozer
13     Whalen

#### (10) job 컬럼에 'SA_'를 포함한 사원을 검색하세요.

In [13]:
df = pd.read_sql("""
                 SELECT employee_id, last_name, job_id
                 FROM employees
                 WHERE job_id LIKE 'SA\_%' ESCAPE '\\'
                 """,xedb)
print(df)

    EMPLOYEE_ID   LAST_NAME  JOB_ID
0           145     Russell  SA_MAN
1           146    Partners  SA_MAN
2           147   Errazuriz  SA_MAN
3           148   Cambrault  SA_MAN
4           149     Zlotkey  SA_MAN
5           150      Tucker  SA_REP
6           151   Bernstein  SA_REP
7           152        Hall  SA_REP
8           153       Olsen  SA_REP
9           154   Cambrault  SA_REP
10          155     Tuvault  SA_REP
11          156        King  SA_REP
12          157       Sully  SA_REP
13          158      McEwen  SA_REP
14          159       Smith  SA_REP
15          160       Doran  SA_REP
16          161      Sewall  SA_REP
17          162     Vishney  SA_REP
18          163      Greene  SA_REP
19          164     Marvins  SA_REP
20          165         Lee  SA_REP
21          166        Ande  SA_REP
22          167       Banda  SA_REP
23          168        Ozer  SA_REP
24          169       Bloom  SA_REP
25          170         Fox  SA_REP
26          171       Smith  SA_REP
27          172       Bates  SA_REP
28          173       Kumar  SA_REP
29          174        Abel  SA_REP
30          175      Hutton  SA_REP
31          176      Taylor  SA_REP
32          177  Livingston  SA_REP
33          178       Grant  SA_REP
34          179     Johnson  SA_REP

In [14]:
cur.close()
xedb.close()